var school = [
    {
        "NO": "100",
        "NAME": "國立臺灣師大附中"
    },
    {
        "NO": "101",
        "NAME": "臺北市立第一女中"
    },
    {
        "NO": "102",
        "NAME": "臺北市立建國高中"
    },
    {
        "NO": "103",
        "NAME": "臺北市立中山女中"
    },
    {
        "NO": "104",
        "NAME": "臺北市立景美女中"
    },
    {
        "NO": "105",
        "NAME": "臺北市立成功高中"
    },
    {
        "NO": "106",
        "NAME": "臺北市立復興高中"
    },
    {
        "NO": "107",
        "NAME": "臺北市立中正高中"
    },
    {
        "NO": "108",
        "NAME": "臺北市立內湖高中"
    },
    {
        "NO": "109",
        "NAME": "臺北市立松山高中"
    },
    {
        "NO": "110",
        "NAME": "臺北市立大同高中"
    },
    {
        "NO": "111",
        "NAME": "臺北市立松山家商"
    },
    {
        "NO": "112",
        "NAME": "臺北市立大安高工"
    },
    {
        "NO": "113",
        "NAME": "臺北市立松山工農"
    },
    {
        "NO": "114",
        "NAME": "臺北市立成淵高中"
    },
    {
        "NO": "115",
        "NAME": "國立政大附中"
    },
    {
        "NO": "116",
        "NAME": "私立衛理女中"
    },
    {
        "NO": "117",
        "NAME": "私立華興高中"
    },
    {
        "NO": "118",
        "NAME": "私立景文高中"
    },
    {
        "NO": "119",
        "NAME": "私立再興高中"
    },
    {
        "NO": "120",
        "NAME": "私立大誠高中"
    },
    {
        "NO": "121",
        "NAME": "私立延平高中"
    },
    {
        "NO": "122",
        "NAME": "私立協和祐德高中"
    },
    {
        "NO": "123",
        "NAME": "私立滬江高中"
    },
    {
        "NO": "124",
        "NAME": "私立強恕高中"
    },
    {
        "NO": "125",
        "NAME": "私立靜修女中"
    },
    {
        "NO": "126",
        "NAME": "私立方濟高中"
    },
    {
        "NO": "127",
        "NAME": "私立薇閣高中"
    },
    {
        "NO": "128",
        "NAME": "私立惇敘工商"
    },
    {
        "NO": "129",
        "NAME": "私立文德女中"
    },
    {
        "NO": "130",
        "NAME": "私立泰北高中"
    },
    {
        "NO": "131",
        "NAME": "私立開平餐飲職業學校"
    },
    {
        "NO": "132",
        "NAME": "私立復興實驗高中"
    },
    {
        "NO": "133",
        "NAME": "私立東方工商"
    },
    {
        "NO": "134",
        "NAME": "私立中興高中"
    },
    {
        "NO": "135",
        "NAME": "私立喬治工商"
    },
    {
        "NO": "136",
        "NAME": "私立東山高中"
    },
    {
        "NO": "137",
        "NAME": "私立奎山實驗高中"
    },
    {
        "NO": "142",
        "NAME": "私立幼華高中"
    },
    {
        "NO": "143",
        "NAME": "私立協和工商"
    },
    {
        "NO": "144",
        "NAME": "私立開南商工"
    },
    {
        "NO": "145",
        "NAME": "私立志仁家商"
    },
    {
        "NO": "146",
        "NAME": "私立金甌女中"
    },
    {
        "NO": "147",
        "NAME": "私立稻江高商"
    },
    {
        "NO": "148",
        "NAME": "私立育達家商"
    },
    {
        "NO": "149",
        "NAME": "私立立人高中"
    },
    {
        "NO": "150",
        "NAME": "私立大同高中"
    },
    {
        "NO": "151",
        "NAME": "私立稻江護家"
    },
    {
        "NO": "153",
        "NAME": "私立華岡藝校"
    },
    {
        "NO": "155",
        "NAME": "私立達人女中"
    },
    {
        "NO": "156",
        "NAME": "臺北市立南港高工"
    },
    {
        "NO": "157",
        "NAME": "臺北市立士林高商"
    },
    {
        "NO": "158",
        "NAME": "臺北市立木柵高工"
    },
    {
        "NO": "159",
        "NAME": "臺北市立內湖高工"
    },
    {
        "NO": "160",
        "NAME": "臺北市立明倫高中"
    },
    {
        "NO": "161",
        "NAME": "臺北市立華江高中"
    },
    {
        "NO": "162",
        "NAME": "臺北市立陽明高中"
    },
    {
        "NO": "163",
        "NAME": "臺北市立永春高中"
    },
    {
        "NO": "164",
        "NAME": "臺北市立和平高中"
    },
    {
        "NO": "165",
        "NAME": "臺北市立西松高中"
    },
    {
        "NO": "166",
        "NAME": "臺北市立大理高中"
    },
    {
        "NO": "167",
        "NAME": "臺北市立啟明學校"
    },
    {
        "NO": "168",
        "NAME": "新北市立鶯歌工商"
    },
    {
        "NO": "169",
        "NAME": "臺北市立大直高中"
    },
    {
        "NO": "170",
        "NAME": "臺北市立萬芳高中"
    },
    {
        "NO": "171",
        "NAME": "臺北市立百齡高中"
    },
    {
        "NO": "172",
        "NAME": "臺北市立南港高中"
    },
    {
        "NO": "173",
        "NAME": "臺北市立麗山高中"
    },
    {
        "NO": "174",
        "NAME": "臺北市立啟聰學校"
    },
    {
        "NO": "175",
        "NAME": "臺北市立育成高中"
    },
    {
        "NO": "176",
        "NAME": "臺北市立中崙高中"
    },
    {
        "NO": "177",
        "NAME": "臺北市立南湖高中"
    },
    {
        "NO": "178",
        "NAME": "私立林口康橋高中"
    },
    {
        "NO": "179",
        "NAME": "私立靜心高中"
    },
    {
        "NO": "180",
        "NAME": "新北市立豐珠中學"
    },
    {
        "NO": "198",
        "NAME": "臺北市立文山特殊教育學校"
    },
    {
        "NO": "199",
        "NAME": "臺北市立啟智學校"
    },
    {
        "NO": "200",
        "NAME": "國立華僑高中"
    },
    {
        "NO": "201",
        "NAME": "新北市立樟樹實中"
    },
    {
        "NO": "202",
        "NAME": "私立裕德高中"
    },
    {
        "NO": "203",
        "NAME": "新北市立北大高中"
    },
    {
        "NO": "204",
        "NAME": "新北市立新北高中"
    },
    {
        "NO": "205",
        "NAME": "新北市立新莊高中"
    },
    {
        "NO": "206",
        "NAME": "新北市立板橋高中"
    },
    {
        "NO": "207",
        "NAME": "新北市立泰山高中"
    },
    {
        "NO": "208",
        "NAME": "新北市立新店高中"
    },
    {
        "NO": "209",
        "NAME": "新北市立中和高中"
    },
    {
        "NO": "210",
        "NAME": "新北市立瑞芳高工"
    },
    {
        "NO": "211",
        "NAME": "新北市立丹鳳高中"
    },
    {
        "NO": "212",
        "NAME": "新北市立竹圍高中"
    },
    {
        "NO": "213",
        "NAME": "私立時雨高中"
    },
    {
        "NO": "214",
        "NAME": "新北市立光復高中"
    },
    {
        "NO": "215",
        "NAME": "新北市立新北高工"
    },
    {
        "NO": "216",
        "NAME": "新北市立三重商工"
    },
    {
        "NO": "217",
        "NAME": "新北市立淡水商工"
    },
    {
        "NO": "218",
        "NAME": "私立格致高中"
    },
    {
        "NO": "219",
        "NAME": "私立南強工商"
    },
    {
        "NO": "220",
        "NAME": "私立竹林高中"
    },
    {
        "NO": "221",
        "NAME": "私立淡江高中"
    },
    {
        "NO": "222",
        "NAME": "私立崇光女中"
    },
    {
        "NO": "223",
        "NAME": "私立醒吾高中"
    },
    {
        "NO": "224",
        "NAME": "私立穀保家商"
    },
    {
        "NO": "225",
        "NAME": "私立聖心女中"
    },
    {
        "NO": "226",
        "NAME": "私立徐匯高中"
    },
    {
        "NO": "227",
        "NAME": "私立及人高中"
    },
    {
        "NO": "228",
        "NAME": "私立東海高中"
    },
    {
        "NO": "229",
        "NAME": "私立中華高中"
    },
    {
        "NO": "230",
        "NAME": "私立莊敬工家"
    },
    {
        "NO": "231",
        "NAME": "私立光仁高中"
    },
    {
        "NO": "232",
        "NAME": "私立恆毅高中"
    },
    {
        "NO": "233",
        "NAME": "私立崇義高中"
    },
    {
        "NO": "234",
        "NAME": "新北市立永平高中"
    },
    {
        "NO": "235",
        "NAME": "私立金陵女中"
    },
    {
        "NO": "236",
        "NAME": "私立樹人家商"
    },
    {
        "NO": "237",
        "NAME": "私立辭修高中"
    },
    {
        "NO": "238",
        "NAME": "私立能仁家商"
    },
    {
        "NO": "239",
        "NAME": "私立豫章工商"
    },
    {
        "NO": "240",
        "NAME": "私立開明工商"
    },
    {
        "NO": "241",
        "NAME": "私立復興商工"
    },
    {
        "NO": "242",
        "NAME": "私立智光商工"
    },
    {
        "NO": "243",
        "NAME": "新北市立明德高中"
    },
    {
        "NO": "244",
        "NAME": "私立清傳高商"
    },
    {
        "NO": "246",
        "NAME": "新北市立樹林高中"
    },
    {
        "NO": "247",
        "NAME": "私立中華商海"
    },
    {
        "NO": "248",
        "NAME": "私立南山高中"
    },
    {
        "NO": "249",
        "NAME": "新北市立雙溪高中"
    },
    {
        "NO": "250",
        "NAME": "新北市立金山高中"
    },
    {
        "NO": "251",
        "NAME": "新北市立清水高中"
    },
    {
        "NO": "252",
        "NAME": "新北市立三民高中"
    },
    {
        "NO": "253",
        "NAME": "新北市立海山高中"
    },
    {
        "NO": "254",
        "NAME": "新北市立秀峰高中"
    },
    {
        "NO": "255",
        "NAME": "國立基隆高中"
    },
    {
        "NO": "256",
        "NAME": "國立基隆女中"
    },
    {
        "NO": "257",
        "NAME": "新北市立三重高中"
    },
    {
        "NO": "258",
        "NAME": "新北市立錦和高中"
    },
    {
        "NO": "259",
        "NAME": "新北市立安康高中"
    },
    {
        "NO": "260",
        "NAME": "國立基隆商工"
    },
    {
        "NO": "261",
        "NAME": "國立基隆海事"
    },
    {
        "NO": "262",
        "NAME": "輔大聖心高中"
    },
    {
        "NO": "263",
        "NAME": "私立光隆家商"
    },
    {
        "NO": "264",
        "NAME": "新北市立石碇高中"
    },
    {
        "NO": "265",
        "NAME": "基隆市立中山高中"
    },
    {
        "NO": "266",
        "NAME": "私立二信高中"
    },
    {
        "NO": "267",
        "NAME": "私立培德工家"
    },
    {
        "NO": "268",
        "NAME": "新北市立林口高中"
    },
    {
        "NO": "269",
        "NAME": "私立康橋高中"
    },
    {
        "NO": "270",
        "NAME": "國立宜蘭高中"
    },
    {
        "NO": "271",
        "NAME": "國立蘭陽女中"
    },
    {
        "NO": "272",
        "NAME": "國立宜蘭高商"
    },
    {
        "NO": "273",
        "NAME": "私立中道高中"
    },
    {
        "NO": "274",
        "NAME": "私立慧燈高中"
    },
    {
        "NO": "275",
        "NAME": "宜蘭縣立南澳高中"
    },
    {
        "NO": "276",
        "NAME": "基隆市立安樂高中"
    },
    {
        "NO": "277",
        "NAME": "基隆市立暖暖高中"
    },
    {
        "NO": "278",
        "NAME": "基隆市立八斗高中"
    },
    {
        "NO": "279",
        "NAME": "宜蘭縣立慈心華德福實驗高中"
    },
    {
        "NO": "280",
        "NAME": "國立羅東高工"
    },
    {
        "NO": "281",
        "NAME": "國立蘇澳海事"
    },
    {
        "NO": "282",
        "NAME": "國立頭城家商"
    },
    {
        "NO": "283",
        "NAME": "國立羅東高中"
    },
    {
        "NO": "284",
        "NAME": "國立羅東高商"
    },
    {
        "NO": "285",
        "NAME": "桃園市立觀音高中"
    },
    {
        "NO": "287",
        "NAME": "國立中央大學附屬中壢高中"
    },
    {
        "NO": "288",
        "NAME": "桃園市立楊梅高中"
    },
    {
        "NO": "289",
        "NAME": "桃園市立武陵高中"
    },
    {
        "NO": "290",
        "NAME": "桃園市立大園國際高中"
    },
    {
        "NO": "291",
        "NAME": "桃園市立桃園高中"
    },
    {
        "NO": "292",
        "NAME": "國立科學工業園區實驗高中"
    },
    {
        "NO": "293",
        "NAME": "桃園市立平鎮高中"
    },
    {
        "NO": "294",
        "NAME": "私立大華高中"
    },
    {
        "NO": "295",
        "NAME": "桃園市立內壢高中"
    },
    {
        "NO": "296",
        "NAME": "桃園市立永豐高中"
    },
    {
        "NO": "297",
        "NAME": "桃園市立南崁高中"
    },
    {
        "NO": "298",
        "NAME": "桃園市立大溪高中"
    },
    {
        "NO": "299",
        "NAME": "桃園市立壽山高中"
    },
    {
        "NO": "300",
        "NAME": "國立新竹高中"
    },
    {
        "NO": "301",
        "NAME": "國立新竹女中"
    },
    {
        "NO": "302",
        "NAME": "國立竹東高中"
    },
    {
        "NO": "303",
        "NAME": "國立竹南高中"
    },
    {
        "NO": "304",
        "NAME": "桃園市立陽明高中"
    },
    {
        "NO": "305",
        "NAME": "國立竹北高中"
    },
    {
        "NO": "306",
        "NAME": "桃園市立中壢家商"
    },
    {
        "NO": "307",
        "NAME": "國立卓蘭高中"
    },
    {
        "NO": "308",
        "NAME": "國立苗栗高中"
    },
    {
        "NO": "309",
        "NAME": "新竹市立成德高中"
    },
    {
        "NO": "310",
        "NAME": "新竹市立香山高中"
    },
    {
        "NO": "311",
        "NAME": "新竹縣立湖口高中"
    },
    {
        "NO": "312",
        "NAME": "苗栗縣立興華高中"
    },
    {
        "NO": "313",
        "NAME": "苗栗縣立苑裡高中"
    },
    {
        "NO": "314",
        "NAME": "國立苑裡高中"
    },
    {
        "NO": "315",
        "NAME": "國立新竹高工"
    },
    {
        "NO": "316",
        "NAME": "國立新竹高商"
    },
    {
        "NO": "317",
        "NAME": "桃園市立中壢高商"
    },
    {
        "NO": "318",
        "NAME": "國立苗栗高商"
    },
    {
        "NO": "319",
        "NAME": "國立關西高中"
    },
    {
        "NO": "320",
        "NAME": "國立北科大附屬桃園農工"
    },
    {
        "NO": "321",
        "NAME": "桃園市立龍潭高中"
    },
    {
        "NO": "322",
        "NAME": "國立苗栗農工"
    },
    {
        "NO": "323",
        "NAME": "國立大湖農工"
    },
    {
        "NO": "324",
        "NAME": "私立建臺高中"
    },
    {
        "NO": "325",
        "NAME": "私立全人實驗高中"
    },
    {
        "NO": "326",
        "NAME": "苗栗縣立三義高中"
    },
    {
        "NO": "327",
        "NAME": "苗栗縣立大同高中"
    },
    {
        "NO": "328",
        "NAME": "桃園市立新屋高中"
    },
    {
        "NO": "329",
        "NAME": "新竹市立建功高中"
    },
    {
        "NO": "330",
        "NAME": "私立光復高中"
    },
    {
        "NO": "331",
        "NAME": "私立磐石高中"
    },
    {
        "NO": "332",
        "NAME": "私立曙光女中"
    },
    {
        "NO": "333",
        "NAME": "私立義民高中"
    },
    {
        "NO": "334",
        "NAME": "私立振聲高中"
    },
    {
        "NO": "335",
        "NAME": "私立治平高中"
    },
    {
        "NO": "336",
        "NAME": "私立漢英高中"
    },
    {
        "NO": "337",
        "NAME": "私立復旦高中"
    },
    {
        "NO": "338",
        "NAME": "私立光啟高中"
    },
    {
        "NO": "339",
        "NAME": "私立大成高中"
    },
    {
        "NO": "340",
        "NAME": "私立君毅高中"
    },
    {
        "NO": "341",
        "NAME": "私立方曙商工"
    },
    {
        "NO": "342",
        "NAME": "私立仰德高中"
    },
    {
        "NO": "343",
        "NAME": "國立新竹特殊教育學校"
    },
    {
        "NO": "344",
        "NAME": "新竹縣立六家高中"
    },
    {
        "NO": "350",
        "NAME": "私立忠信高中"
    },
    {
        "NO": "351",
        "NAME": "私立成功工商"
    },
    {
        "NO": "352",
        "NAME": "私立賢德工商"
    },
    {
        "NO": "353",
        "NAME": "私立永平工商"
    },
    {
        "NO": "354",
        "NAME": "私立新興高中"
    },
    {
        "NO": "355",
        "NAME": "私立清華高中"
    },
    {
        "NO": "356",
        "NAME": "私立大興高中"
    },
    {
        "NO": "357",
        "NAME": "私立至善高中"
    },
    {
        "NO": "358",
        "NAME": "私立育民工家"
    },
    {
        "NO": "359",
        "NAME": "私立龍德家商"
    },
    {
        "NO": "360",
        "NAME": "私立東泰高中"
    },
    {
        "NO": "361",
        "NAME": "私立世界高中"
    },
    {
        "NO": "362",
        "NAME": "私立中興商工"
    },
    {
        "NO": "363",
        "NAME": "私立內思高工"
    },
    {
        "NO": "364",
        "NAME": "私立啟英高中"
    },
    {
        "NO": "365",
        "NAME": "私立六和高中"
    },
    {
        "NO": "367",
        "NAME": "私立育達高中"
    },
    {
        "NO": "400",
        "NAME": "臺中市立臺中一中"
    },
    {
        "NO": "401",
        "NAME": "臺中市立臺中二中"
    },
    {
        "NO": "402",
        "NAME": "臺中市立臺中女中"
    },
    {
        "NO": "403",
        "NAME": "臺中市立清水高中"
    },
    {
        "NO": "404",
        "NAME": "臺中市立豐原高中"
    },
    {
        "NO": "405",
        "NAME": "臺中市立大甲高中"
    },
    {
        "NO": "406",
        "NAME": "臺中市立文華高中"
    },
    {
        "NO": "407",
        "NAME": "臺中市立新社高中"
    },
    {
        "NO": "408",
        "NAME": "臺中市立長億高中"
    },
    {
        "NO": "409",
        "NAME": "臺中市立西苑高中"
    },
    {
        "NO": "410",
        "NAME": "臺中市立忠明高中"
    },
    {
        "NO": "411",
        "NAME": "國立興大附農"
    },
    {
        "NO": "412",
        "NAME": "臺中市立臺中家商"
    },
    {
        "NO": "413",
        "NAME": "臺中市立臺中高工"
    },
    {
        "NO": "415",
        "NAME": "臺中市立豐原高商"
    },
    {
        "NO": "416",
        "NAME": "臺中市立大甲高工"
    },
    {
        "NO": "417",
        "NAME": "臺中市立沙鹿高工"
    },
    {
        "NO": "418",
        "NAME": "臺中市立東勢高工"
    },
    {
        "NO": "419",
        "NAME": "臺中市立霧峰農工"
    },
    {
        "NO": "420",
        "NAME": "臺中市立啟明學校"
    },
    {
        "NO": "421",
        "NAME": "臺中市立惠文高中"
    },
    {
        "NO": "422",
        "NAME": "國立中興大學附中"
    },
    {
        "NO": "423",
        "NAME": "臺中市立中港高中"
    },
    {
        "NO": "424",
        "NAME": "臺中市立后綜高中"
    },
    {
        "NO": "425",
        "NAME": "私立明道高中"
    },
    {
        "NO": "426",
        "NAME": "私立明台高中"
    },
    {
        "NO": "427",
        "NAME": "私立大明高中"
    },
    {
        "NO": "428",
        "NAME": "私立宜寧高中"
    },
    {
        "NO": "429",
        "NAME": "私立曉明女中"
    },
    {
        "NO": "430",
        "NAME": "私立衛道高中"
    },
    {
        "NO": "431",
        "NAME": "私立青年高中"
    },
    {
        "NO": "432",
        "NAME": "私立立人高中"
    },
    {
        "NO": "433",
        "NAME": "私立弘文高中"
    },
    {
        "NO": "434",
        "NAME": "私立慈明高中"
    },
    {
        "NO": "435",
        "NAME": "私立華盛頓高中"
    },
    {
        "NO": "436",
        "NAME": "私立嘉陽高中"
    },
    {
        "NO": "437",
        "NAME": "臺中市立大里高中"
    },
    {
        "NO": "438",
        "NAME": "私立常春藤高中"
    },
    {
        "NO": "439",
        "NAME": "臺中市立啟聰學校"
    },
    {
        "NO": "440",
        "NAME": "私立明德高中"
    },
    {
        "NO": "441",
        "NAME": "私立玉山高中"
    },
    {
        "NO": "442",
        "NAME": "私立嶺東高中"
    },
    {
        "NO": "443",
        "NAME": "私立僑泰高中"
    },
    {
        "NO": "444",
        "NAME": "私立新民高中"
    },
    {
        "NO": "445",
        "NAME": "私立致用高中"
    },
    {
        "NO": "446",
        "NAME": "私立東海大學附中"
    },
    {
        "NO": "447",
        "NAME": "私立光華高工"
    },
    {
        "NO": "448",
        "NAME": "臺中市立臺中特殊教育學校"
    },
    {
        "NO": "449",
        "NAME": "臺中市立東山高中"
    },
    {
        "NO": "450",
        "NAME": "國立中科實驗高中"
    },
    {
        "NO": "451",
        "NAME": "私立葳格高中"
    },
    {
        "NO": "452",
        "NAME": "臺中市立龍津高中"
    },
    {
        "NO": "453",
        "NAME": "私立磊川華德福實驗教育學校"
    },
    {
        "NO": "454",
        "NAME": "私立華德福大地實驗教育學校"
    },
    {
        "NO": "500",
        "NAME": "國立南投高中"
    },
    {
        "NO": "501",
        "NAME": "國立暨南國際大學附中"
    },
    {
        "NO": "502",
        "NAME": "國立竹山高中"
    },
    {
        "NO": "503",
        "NAME": "國立中興高中"
    },
    {
        "NO": "504",
        "NAME": "私立三育高中"
    },
    {
        "NO": "505",
        "NAME": "私立五育高中"
    },
    {
        "NO": "506",
        "NAME": "國立仁愛高農"
    },
    {
        "NO": "507",
        "NAME": "國立草屯商工"
    },
    {
        "NO": "508",
        "NAME": "國立南投高商"
    },
    {
        "NO": "509",
        "NAME": "國立埔里高工"
    },
    {
        "NO": "510",
        "NAME": "國立水里商工"
    },
    {
        "NO": "511",
        "NAME": "私立同德家商"
    },
    {
        "NO": "512",
        "NAME": "國立彰化師大附屬高工"
    },
    {
        "NO": "513",
        "NAME": "國立和美實驗學校"
    },
    {
        "NO": "514",
        "NAME": "南投縣立旭光高中"
    },
    {
        "NO": "515",
        "NAME": "私立弘明實驗高中"
    },
    {
        "NO": "516",
        "NAME": "私立普台高中"
    },
    {
        "NO": "521",
        "NAME": "國立彰化高中"
    },
    {
        "NO": "522",
        "NAME": "國立員林高中"
    },
    {
        "NO": "523",
        "NAME": "國立彰化女中"
    },
    {
        "NO": "524",
        "NAME": "國立員林家商"
    },
    {
        "NO": "525",
        "NAME": "國立永靖高工"
    },
    {
        "NO": "526",
        "NAME": "國立北斗家商"
    },
    {
        "NO": "527",
        "NAME": "國立鹿港高中"
    },
    {
        "NO": "528",
        "NAME": "國立員林崇實高工"
    },
    {
        "NO": "529",
        "NAME": "彰化縣立二林高中"
    },
    {
        "NO": "530",
        "NAME": "國立二林工商"
    },
    {
        "NO": "531",
        "NAME": "國立彰化高商"
    },
    {
        "NO": "532",
        "NAME": "國立秀水高工"
    },
    {
        "NO": "533",
        "NAME": "國立員林農工"
    },
    {
        "NO": "534",
        "NAME": "私立達德商工"
    },
    {
        "NO": "535",
        "NAME": "私立大慶商工"
    },
    {
        "NO": "536",
        "NAME": "私立正德高中"
    },
    {
        "NO": "540",
        "NAME": "私立精誠高中"
    },
    {
        "NO": "542",
        "NAME": "私立文興高中"
    },
    {
        "NO": "543",
        "NAME": "國立溪湖高中"
    },
    {
        "NO": "544",
        "NAME": "彰化縣立彰化藝術高中"
    },
    {
        "NO": "545",
        "NAME": "國立彰化特殊教育學校"
    },
    {
        "NO": "546",
        "NAME": "彰化縣立成功高中"
    },
    {
        "NO": "547",
        "NAME": "彰化縣立田中高中"
    },
    {
        "NO": "548",
        "NAME": "彰化縣立和美高中"
    },
    {
        "NO": "600",
        "NAME": "國立嘉義高中"
    },
    {
        "NO": "601",
        "NAME": "國立嘉義女中"
    },
    {
        "NO": "602",
        "NAME": "國立民雄農工"
    },
    {
        "NO": "603",
        "NAME": "國立東石高中"
    },
    {
        "NO": "605",
        "NAME": "國立嘉義高工"
    },
    {
        "NO": "606",
        "NAME": "國立華南高商"
    },
    {
        "NO": "607",
        "NAME": "國立嘉義高商"
    },
    {
        "NO": "608",
        "NAME": "國立嘉義家職"
    },
    {
        "NO": "610",
        "NAME": "私立大同高商"
    },
    {
        "NO": "611",
        "NAME": "私立萬能工商"
    },
    {
        "NO": "612",
        "NAME": "嘉義縣立竹崎高中"
    },
    {
        "NO": "613",
        "NAME": "嘉義縣立永慶高中"
    },
    {
        "NO": "615",
        "NAME": "私立協同高中"
    },
    {
        "NO": "616",
        "NAME": "私立同濟高中"
    },
    {
        "NO": "617",
        "NAME": "私立東吳工家"
    },
    {
        "NO": "618",
        "NAME": "私立興華高中"
    },
    {
        "NO": "619",
        "NAME": "私立宏仁女中"
    },
    {
        "NO": "620",
        "NAME": "私立輔仁高中"
    },
    {
        "NO": "621",
        "NAME": "私立嘉華高中"
    },
    {
        "NO": "622",
        "NAME": "私立仁義高中"
    },
    {
        "NO": "626",
        "NAME": "私立協志工商"
    },
    {
        "NO": "627",
        "NAME": "私立立仁高中"
    },
    {
        "NO": "628",
        "NAME": "私立弘德工商"
    },
    {
        "NO": "629",
        "NAME": "國立新港藝術高中"
    },
    {
        "NO": "650",
        "NAME": "國立西螺農工"
    },
    {
        "NO": "651",
        "NAME": "國立虎尾高中"
    },
    {
        "NO": "652",
        "NAME": "國立北港高中"
    },
    {
        "NO": "654",
        "NAME": "國立斗六高中"
    },
    {
        "NO": "660",
        "NAME": "國立土庫商工"
    },
    {
        "NO": "661",
        "NAME": "國立北港農工"
    },
    {
        "NO": "662",
        "NAME": "國立斗六家商"
    },
    {
        "NO": "663",
        "NAME": "國立虎尾農工"
    },
    {
        "NO": "664",
        "NAME": "雲林縣立麥寮高中"
    },
    {
        "NO": "665",
        "NAME": "雲林縣立斗南高中"
    },
    {
        "NO": "666",
        "NAME": "私立文生高中"
    },
    {
        "NO": "668",
        "NAME": "私立正心高中"
    },
    {
        "NO": "669",
        "NAME": "私立永年高中"
    },
    {
        "NO": "670",
        "NAME": "私立揚子高中"
    },
    {
        "NO": "671",
        "NAME": "私立維多利亞實驗高中"
    },
    {
        "NO": "672",
        "NAME": "雲林縣立古坑華德福實驗高中"
    },
    {
        "NO": "675",
        "NAME": "私立巨人高中"
    },
    {
        "NO": "676",
        "NAME": "私立大成商工"
    },
    {
        "NO": "677",
        "NAME": "私立大德工商"
    },
    {
        "NO": "680",
        "NAME": "私立義峰高中"
    },
    {
        "NO": "681",
        "NAME": "私立福智高中"
    },
    {
        "NO": "682",
        "NAME": "雲林縣立蔦松藝術高中"
    },
    {
        "NO": "700",
        "NAME": "國立臺南一中"
    },
    {
        "NO": "701",
        "NAME": "國立臺南女中"
    },
    {
        "NO": "702",
        "NAME": "國立臺南二中"
    },
    {
        "NO": "703",
        "NAME": "國立家齊高中"
    },
    {
        "NO": "704",
        "NAME": "國立新營高中"
    },
    {
        "NO": "705",
        "NAME": "國立後壁高中"
    },
    {
        "NO": "706",
        "NAME": "國立善化高中"
    },
    {
        "NO": "707",
        "NAME": "國立玉井工商"
    },
    {
        "NO": "708",
        "NAME": "國立北門高中"
    },
    {
        "NO": "709",
        "NAME": "國立曾文農工"
    },
    {
        "NO": "710",
        "NAME": "國立新化高中"
    },
    {
        "NO": "711",
        "NAME": "國立新豐高中"
    },
    {
        "NO": "712",
        "NAME": "臺南市立大灣高中"
    },
    {
        "NO": "713",
        "NAME": "臺南市立永仁高中"
    },
    {
        "NO": "714",
        "NAME": "國立臺南大學附屬啟聰學校"
    },
    {
        "NO": "715",
        "NAME": "國立新化高工"
    },
    {
        "NO": "716",
        "NAME": "國立北門農工"
    },
    {
        "NO": "718",
        "NAME": "國立曾文家商"
    },
    {
        "NO": "719",
        "NAME": "國立臺南海事"
    },
    {
        "NO": "720",
        "NAME": "國立白河商工"
    },
    {
        "NO": "721",
        "NAME": "國立新營高工"
    },
    {
        "NO": "722",
        "NAME": "國立臺南高商"
    },
    {
        "NO": "723",
        "NAME": "國立臺南高工"
    },
    {
        "NO": "724",
        "NAME": "國立臺南大學附中"
    },
    {
        "NO": "728",
        "NAME": "臺南市立土城高中"
    },
    {
        "NO": "729",
        "NAME": "臺南市立南寧高中"
    },
    {
        "NO": "730",
        "NAME": "私立瀛海高中"
    },
    {
        "NO": "731",
        "NAME": "私立聖功女中"
    },
    {
        "NO": "732",
        "NAME": "私立長榮高中"
    },
    {
        "NO": "734",
        "NAME": "私立德光高中"
    },
    {
        "NO": "735",
        "NAME": "私立崑山高中"
    },
    {
        "NO": "736",
        "NAME": "私立長榮女中"
    },
    {
        "NO": "737",
        "NAME": "私立光華高中"
    },
    {
        "NO": "738",
        "NAME": "私立黎明高中"
    },
    {
        "NO": "739",
        "NAME": "私立南光高中"
    },
    {
        "NO": "740",
        "NAME": "私立興國高中"
    },
    {
        "NO": "741",
        "NAME": "私立明達高中"
    },
    {
        "NO": "742",
        "NAME": "私立港明高中"
    },
    {
        "NO": "743",
        "NAME": "私立鳳和高中"
    },
    {
        "NO": "750",
        "NAME": "私立六信高中"
    },
    {
        "NO": "751",
        "NAME": "私立慈幼工商"
    },
    {
        "NO": "752",
        "NAME": "私立南英商工"
    },
    {
        "NO": "753",
        "NAME": "私立陽明工商"
    },
    {
        "NO": "754",
        "NAME": "私立新榮高中"
    },
    {
        "NO": "755",
        "NAME": "私立天仁工商"
    },
    {
        "NO": "757",
        "NAME": "私立育德工家"
    },
    {
        "NO": "758",
        "NAME": "私立亞洲餐旅學校"
    },
    {
        "NO": "760",
        "NAME": "私立華濟永安高中"
    },
    {
        "NO": "761",
        "NAME": "私立慈濟高中"
    },
    {
        "NO": "762",
        "NAME": "國立南科國際實驗高中"
    },
    {
        "NO": "770",
        "NAME": "國立馬公高中"
    },
    {
        "NO": "771",
        "NAME": "國立澎湖海事高職"
    },
    {
        "NO": "780",
        "NAME": "國立金門高中"
    },
    {
        "NO": "781",
        "NAME": "國立金門農工"
    },
    {
        "NO": "790",
        "NAME": "國立馬祖高中"
    },
    {
        "NO": "800",
        "NAME": "國立高雄師大附中"
    },
    {
        "NO": "801",
        "NAME": "高雄市立高雄高中"
    },
    {
        "NO": "802",
        "NAME": "高雄市立高雄女中"
    },
    {
        "NO": "803",
        "NAME": "高雄市立左營高中"
    },
    {
        "NO": "804",
        "NAME": "高雄市立前鎮高中"
    },
    {
        "NO": "805",
        "NAME": "高雄市立高雄高商"
    },
    {
        "NO": "806",
        "NAME": "高雄市立高雄高工"
    },
    {
        "NO": "807",
        "NAME": "高雄市立中正高工"
    },
    {
        "NO": "808",
        "NAME": "高雄市立海青工商"
    },
    {
        "NO": "809",
        "NAME": "高雄市立中山高中"
    },
    {
        "NO": "810",
        "NAME": "高雄市立小港高中"
    },
    {
        "NO": "811",
        "NAME": "高雄市立新莊高中"
    },
    {
        "NO": "812",
        "NAME": "國立鳳山高中"
    },
    {
        "NO": "813",
        "NAME": "國立鳳新高中"
    },
    {
        "NO": "814",
        "NAME": "國立旗美高中"
    },
    {
        "NO": "815",
        "NAME": "國立岡山高中"
    },
    {
        "NO": "816",
        "NAME": "高雄市立三民家商"
    },
    {
        "NO": "817",
        "NAME": "國立岡山農工"
    },
    {
        "NO": "818",
        "NAME": "國立旗山農工"
    },
    {
        "NO": "819",
        "NAME": "國立鳳山商工"
    },
    {
        "NO": "820",
        "NAME": "私立新光高中"
    },
    {
        "NO": "821",
        "NAME": "私立樹德家商"
    },
    {
        "NO": "822",
        "NAME": "國立中山大學附中"
    },
    {
        "NO": "823",
        "NAME": "私立復華高中"
    },
    {
        "NO": "824",
        "NAME": "私立立志高中"
    },
    {
        "NO": "825",
        "NAME": "私立道明高中"
    },
    {
        "NO": "826",
        "NAME": "私立明誠高中"
    },
    {
        "NO": "828",
        "NAME": "私立中華藝校"
    },
    {
        "NO": "829",
        "NAME": "私立普門高中"
    },
    {
        "NO": "830",
        "NAME": "高雄市立瑞祥高中"
    },
    {
        "NO": "831",
        "NAME": "高雄市立中正高中"
    },
    {
        "NO": "832",
        "NAME": "高雄市立三民高中"
    },
    {
        "NO": "833",
        "NAME": "高雄市立林園高中"
    },
    {
        "NO": "834",
        "NAME": "高雄市立鼓山高中"
    },
    {
        "NO": "835",
        "NAME": "私立華德工家"
    },
    {
        "NO": "837",
        "NAME": "私立大榮高中"
    },
    {
        "NO": "838",
        "NAME": "私立三信家商"
    },
    {
        "NO": "839",
        "NAME": "私立國際商工"
    },
    {
        "NO": "841",
        "NAME": "私立旗美商工"
    },
    {
        "NO": "842",
        "NAME": "私立高英工商"
    },
    {
        "NO": "843",
        "NAME": "私立中山工商"
    },
    {
        "NO": "845",
        "NAME": "私立高苑工商"
    },
    {
        "NO": "846",
        "NAME": "私立高鳳工家"
    },
    {
        "NO": "849",
        "NAME": "私立正義高中"
    },
    {
        "NO": "850",
        "NAME": "高雄市立仁武高中"
    },
    {
        "NO": "851",
        "NAME": "高雄市立路竹高中"
    },
    {
        "NO": "852",
        "NAME": "高雄市立文山高中"
    },
    {
        "NO": "853",
        "NAME": "高雄市立新興高中"
    },
    {
        "NO": "854",
        "NAME": "高雄市立福誠高中"
    },
    {
        "NO": "855",
        "NAME": "高雄市立六龜高中"
    },
    {
        "NO": "856",
        "NAME": "高雄市立楠梓特殊學校"
    },
    {
        "NO": "857",
        "NAME": "高雄市立楠梓高中"
    },
    {
        "NO": "858",
        "NAME": "私立義大國際高中"
    },
    {
        "NO": "859",
        "NAME": "國立高雄餐旅大學附中"
    },
    {
        "NO": "860",
        "NAME": "私立南海月光實驗教育學校"
    },
    {
        "NO": "900",
        "NAME": "國立屏東女中"
    },
    {
        "NO": "901",
        "NAME": "國立屏東高中"
    },
    {
        "NO": "902",
        "NAME": "國立潮州高中"
    },
    {
        "NO": "903",
        "NAME": "國立恆春工商"
    },
    {
        "NO": "904",
        "NAME": "屏東縣立大同高中"
    },
    {
        "NO": "905",
        "NAME": "國立屏北高中"
    },
    {
        "NO": "906",
        "NAME": "國立東港海事"
    },
    {
        "NO": "907",
        "NAME": "國立佳冬高農"
    },
    {
        "NO": "908",
        "NAME": "國立內埔農工"
    },
    {
        "NO": "909",
        "NAME": "國立屏東高工"
    },
    {
        "NO": "910",
        "NAME": "屏東縣立枋寮高中"
    },
    {
        "NO": "912",
        "NAME": "私立新基高中"
    },
    {
        "NO": "913",
        "NAME": "私立陸興高中"
    },
    {
        "NO": "914",
        "NAME": "私立美和高中"
    },
    {
        "NO": "915",
        "NAME": "屏東縣立來義高中"
    },
    {
        "NO": "916",
        "NAME": "私立日新工商"
    },
    {
        "NO": "917",
        "NAME": "私立華洲工家"
    },
    {
        "NO": "918",
        "NAME": "私立民生家商"
    },
    {
        "NO": "920",
        "NAME": "私立屏榮高中"
    },
    {
        "NO": "922",
        "NAME": "屏東縣立東港高中"
    },
    {
        "NO": "930",
        "NAME": "國立花蓮高中"
    },
    {
        "NO": "931",
        "NAME": "國立花蓮女中"
    },
    {
        "NO": "932",
        "NAME": "國立玉里高中"
    },
    {
        "NO": "933",
        "NAME": "國立臺東高中"
    },
    {
        "NO": "934",
        "NAME": "國立臺東女中"
    },
    {
        "NO": "935",
        "NAME": "國立臺東大學附屬體育高中"
    },
    {
        "NO": "936",
        "NAME": "臺東縣立蘭嶼高中"
    },
    {
        "NO": "937",
        "NAME": "國立臺東大學附屬特殊教育學校"
    },
    {
        "NO": "938",
        "NAME": "私立均一高中"
    },
    {
        "NO": "940",
        "NAME": "國立花蓮高農"
    },
    {
        "NO": "941",
        "NAME": "國立花蓮高工"
    },
    {
        "NO": "942",
        "NAME": "國立花蓮高商"
    },
    {
        "NO": "943",
        "NAME": "國立臺東高商"
    },
    {
        "NO": "944",
        "NAME": "國立臺東專科學校附設高職部"
    },
    {
        "NO": "945",
        "NAME": "國立關山工商"
    },
    {
        "NO": "946",
        "NAME": "國立成功商業水產"
    },
    {
        "NO": "947",
        "NAME": "國立光復商工"
    },
    {
        "NO": "949",
        "NAME": "花蓮縣立體育高中"
    },
    {
        "NO": "950",
        "NAME": "私立四維高中"
    },
    {
        "NO": "951",
        "NAME": "私立海星高中"
    },
    {
        "NO": "952",
        "NAME": "私立育仁高中"
    },
    {
        "NO": "955",
        "NAME": "私立公東高工"
    },
    {
        "NO": "956",
        "NAME": "私立國光商工"
    },
    {
        "NO": "957",
        "NAME": "私立上騰工商"
    },
    {
        "NO": "958",
        "NAME": "私立慈濟大學附中"
    },
    {
        "NO": "971",
        "NAME": "海外臺灣學校"
    },
    {
        "NO": "972",
        "NAME": "大陸台商子弟學校"
    },
    {
        "NO": "973",
        "NAME": "大陸及港澳地區學校"
    },
    {
        "NO": "979",
        "NAME": "範例高中"
    },
    {
        "NO": "981",
        "NAME": "私立南華高中職業進修學校"
    },
    {
        "NO": "982",
        "NAME": "私立志仁高中職業進修學校"
    },
    {
        "NO": "989",
        "NAME": "國立臺灣戲曲學院"
    },
    {
        "NO": "990",
        "NAME": "七年一貫制學校"
    },
    {
        "NO": "991",
        "NAME": "中正預校"
    },
    {
        "NO": "992",
        "NAME": "高普考或乙丙等特考及格"
    },
    {
        "NO": "993",
        "NAME": "五年制專科學校"
    },
    {
        "NO": "994",
        "NAME": "師範學校"
    },
    {
        "NO": "995",
        "NAME": "進修學校(補校)或夜間部"
    },
    {
        "NO": "996",
        "NAME": "空中補校"
    },
    {
        "NO": "997",
        "NAME": "國外學校"
    },
    {
        "NO": "998",
        "NAME": "學力鑑定考試及格"
    },
    {
        "NO": "999",
        "NAME": "漏列學校或其他"
    },
    {
        "NO": "A04",
        "NAME": "臺北儒林補習班"
    },
    {
        "NO": "A06",
        "NAME": "桃園昊德文理補習班"
    },
    {
        "NO": "A10",
        "NAME": "臺北文城補習班"
    },
    {
        "NO": "A12",
        "NAME": "臺北同心補習班"
    },
    {
        "NO": "A15",
        "NAME": "臺北夏朵補習班"
    },
    {
        "NO": "A28",
        "NAME": "臺中高登補習班"
    },
    {
        "NO": "A29",
        "NAME": "臺中立人補習班"
    },
    {
        "NO": "A32",
        "NAME": "桃園儒林補習班"
    },
    {
        "NO": "A33",
        "NAME": "臺中順天儒林補習班"
    },
    {
        "NO": "A37",
        "NAME": "臺中國立補習班"
    },
    {
        "NO": "A39",
        "NAME": "嘉義道成補習班"
    },
    {
        "NO": "A41",
        "NAME": "臺南宏達補習班"
    },
    {
        "NO": "A42",
        "NAME": "臺南同心文理補習班"
    },
    {
        "NO": "A43",
        "NAME": "臺南樺薪文理補習班"
    },
    {
        "NO": "A47",
        "NAME": "高雄力行補習班"
    },
    {
        "NO": "A50",
        "NAME": "高雄宏儒補習班"
    },
    {
        "NO": "A52",
        "NAME": "高雄遠東補習班"
    },
    {
        "NO": "A59",
        "NAME": "宜蘭儒林補習班"
    },
    {
        "NO": "A67",
        "NAME": "臺南上景補習班"
    },
    {
        "NO": "A72",
        "NAME": "臺南建儒補習班"
    },
    {
        "NO": "A77",
        "NAME": "臺北力誠補習班"
    },
    {
        "NO": "A81",
        "NAME": "臺中儒林補習班"
    },
    {
        "NO": "A83",
        "NAME": "桃園林冠傑補習班"
    },
    {
        "NO": "A84",
        "NAME": "臺中弘越補習班"
    },
    {
        "NO": "A85",
        "NAME": "高雄滿分補習班"
    },
    {
        "NO": "A87",
        "NAME": "臺中何明補習班"
    },
    {
        "NO": "A88",
        "NAME": "高雄順天北儒補習班"
    },
    {
        "NO": "A89",
        "NAME": "臺中得勝城補習班"
    },
    {
        "NO": "A90",
        "NAME": "臺北得勝者補習班"
    },
    {
        "NO": "A97",
        "NAME": "範例補習班"
    },
    {
        "NO": "B03",
        "NAME": "臺北市立松山家商夜間部"
    },
    {
        "NO": "B04",
        "NAME": "臺北市立大安高工進修部"
    },
    {
        "NO": "B05",
        "NAME": "臺北市立松山工農夜間部"
    },
    {
        "NO": "B08",
        "NAME": "私立中興高中附設進修學校"
    },
    {
        "NO": "B09",
        "NAME": "私立協和工商夜間部"
    },
    {
        "NO": "B10",
        "NAME": "私立育達家商夜間部"
    },
    {
        "NO": "B12",
        "NAME": "臺北市立南港高工附設進修學校"
    },
    {
        "NO": "B13",
        "NAME": "臺北市立士林高商進修部"
    },
    {
        "NO": "B14",
        "NAME": "臺北商業大學附設高商進修學校"
    },
    {
        "NO": "B15",
        "NAME": "私立光華高商職業進修學校"
    },
    {
        "NO": "B16",
        "NAME": "私立泰北高中附設進修部"
    },
    {
        "NO": "B17",
        "NAME": "私立滬江高中附設進修學校"
    },
    {
        "NO": "B18",
        "NAME": "私立東海高中附設進修學校"
    },
    {
        "NO": "B19",
        "NAME": "私立豫章工商附設進修學校"
    },
    {
        "NO": "B20",
        "NAME": "私立復興商工夜間部"
    },
    {
        "NO": "B21",
        "NAME": "私立復興商工進修部"
    },
    {
        "NO": "B22",
        "NAME": "國立竹東高中附設進修學校"
    },
    {
        "NO": "B23",
        "NAME": "私立振聲高中附設進修學校"
    },
    {
        "NO": "B24",
        "NAME": "私立育民工家附設進修學校"
    },
    {
        "NO": "B25",
        "NAME": "國立臺中科技大學附設高商"
    },
    {
        "NO": "B26",
        "NAME": "臺中市立臺中家商進修部"
    },
    {
        "NO": "B27",
        "NAME": "私立明道高中附設進修學校"
    },
    {
        "NO": "B28",
        "NAME": "臺中市立后綜高中進修學校"
    },
    {
        "NO": "B29",
        "NAME": "國立彰化師大附工附設進修部"
    },
    {
        "NO": "B30",
        "NAME": "國立嘉義高中附設進修學校"
    },
    {
        "NO": "B31",
        "NAME": "私立光華高工附設進修學校"
    },
    {
        "NO": "B32",
        "NAME": "花蓮正德高中附設進修學校"
    },
    {
        "NO": "B33",
        "NAME": "國立臺南一中附設進修學校"
    },
    {
        "NO": "B34",
        "NAME": "私立樹德高中附設進修學校"
    },
    {
        "NO": "B35",
        "NAME": "私立世界高中附設進修學校"
    },
    {
        "NO": "B36",
        "NAME": "高雄市立高雄高商附設進修學校"
    },
    {
        "NO": "B37",
        "NAME": "新北市立淡水商工進修部"
    },
    {
        "NO": "B38",
        "NAME": "私立大榮高中附設進修學校"
    },
    {
        "NO": "B39",
        "NAME": "國立臺南高商進修部"
    },
    {
        "NO": "B40",
        "NAME": "新北市立新北高工附設進修學校"
    },
    {
        "NO": "B41",
        "NAME": "宏德高商進修學校"
    },
    {
        "NO": "B42",
        "NAME": "私立開南商工附設進修學校"
    },
    {
        "NO": "B43",
        "NAME": "新北市立三重商工進修部"
    },
    {
        "NO": "B44",
        "NAME": "私立稻江高商進修部"
    },
    {
        "NO": "B45",
        "NAME": "私立樹人家商附設進修部"
    },
    {
        "NO": "B46",
        "NAME": "私立智光商工附設進修學校"
    },
    {
        "NO": "B47",
        "NAME": "私立明台高中附設進修學校"
    },
    {
        "NO": "B48",
        "NAME": "私立開明工商進修部"
    },
    {
        "NO": "B49",
        "NAME": "私立明德高中進修部"
    },
    {
        "NO": "B50",
        "NAME": "成功大學附設高工進修學校"
    },
    {
        "NO": "B51",
        "NAME": "高雄市立左營高中進修部"
    },
    {
        "NO": "B52",
        "NAME": "國立新竹高工進修部"
    },
    {
        "NO": "B53",
        "NAME": "私立強恕高中附設進修學校"
    },
    {
        "NO": "B54",
        "NAME": "私立新民高中附設進修學校"
    },
    {
        "NO": "B55",
        "NAME": "私立三信家商進修部"
    },
    {
        "NO": "B56",
        "NAME": "國立臺東高商進修部"
    },
    {
        "NO": "B57",
        "NAME": "臺中市立臺中高工進修部"
    },
    {
        "NO": "B58",
        "NAME": "國立員林農工進修學校"
    },
    {
        "NO": "B59",
        "NAME": "國立臺東專科學校附設進修推廣部"
    },
    {
        "NO": "B60",
        "NAME": "國立斗六家商進修部"
    },
    {
        "NO": "B62",
        "NAME": "新北市立泰山高中進修部"
    },
    {
        "NO": "B63",
        "NAME": "國立花蓮高工附設進修部"
    },
    {
        "NO": "B64",
        "NAME": "私立新興高中附設進修學校"
    },
    {
        "NO": "B65",
        "NAME": "臺中市立東勢高工進修部"
    },
    {
        "NO": "B66",
        "NAME": "國立基隆女中附設進修學校"
    },
    {
        "NO": "B67",
        "NAME": "國立員林崇實高工進修部"
    },
    {
        "NO": "B68",
        "NAME": "國立宜蘭高商附設進修部"
    },
    {
        "NO": "B69",
        "NAME": "國立臺南高工進修部"
    },
    {
        "NO": "B70",
        "NAME": "國立彰化高商進修部"
    },
    {
        "NO": "B71",
        "NAME": "私立成功工商進修部"
    },
    {
        "NO": "B72",
        "NAME": "臺中市立沙鹿高工進修部"
    },
    {
        "NO": "B73",
        "NAME": "國立屏東高工進修部"
    },
    {
        "NO": "B74",
        "NAME": "私立至善高中附設進修學校"
    },
    {
        "NO": "B75",
        "NAME": "私立光啟高中進修部"
    },
    {
        "NO": "B76",
        "NAME": "國立中壢高商進修部"
    },
    {
        "NO": "B77",
        "NAME": "私立青年高中進修部"
    },
    {
        "NO": "B78",
        "NAME": "高雄市立海青工商進修部"
    },
    {
        "NO": "B79",
        "NAME": "私立啟英高中進修部"
    },
    {
        "NO": "B80",
        "NAME": "明陽中學"
    },
    {
        "NO": "B81",
        "NAME": "私立正德高中附設進修學校"
    },
    {
        "NO": "B82",
        "NAME": "高雄高工附設進修部"
    },
    {
        "NO": "B83",
        "NAME": "國立新竹高商進修部"
    },
    {
        "NO": "B84",
        "NAME": "國立岡山農工附設進修學校"
    },
    {
        "NO": "B85",
        "NAME": "私立仰德高中附設進修部"
    },
    {
        "NO": "B86",
        "NAME": "臺中市立臺中啟明附設進修學校"
    },
    {
        "NO": "B87",
        "NAME": "國立東石高中進修部"
    },
    {
        "NO": "B88",
        "NAME": "高雄市立中正高工附設進修學校"
    },
    {
        "NO": "B89",
        "NAME": "國立北科大附屬桃園農工附設進修"
    },
    {
        "NO": "B90",
        "NAME": "國立員林家商附設進修學校"
    },
    {
        "NO": "B91",
        "NAME": "國立花蓮高商進修部"
    },
    {
        "NO": "B92",
        "NAME": "國立龍潭高中附設進修學校"
    },
    {
        "NO": "B93",
        "NAME": "誠正中學"
    },
    {
        "NO": "B94",
        "NAME": "國立秀水高工進修部"
    },
    {
        "NO": "B95",
        "NAME": "私立穀保家商附設進修學校"
    },
    {
        "NO": "B96",
        "NAME": "國立西螺農工附設進修學校"
    },
    {
        "NO": "B97",
        "NAME": "國立宜蘭大學附設高職進修學校"
    },
    {
        "NO": "B98",
        "NAME": "國立興大附農進修部"
    },
    {
        "NO": "B99",
        "NAME": "私立治平高中進修部"
    },
    {
        "NO": "C01",
        "NAME": "吉隆坡臺灣學校"
    },
    {
        "NO": "C02",
        "NAME": "雅加達臺灣學校"
    },
    {
        "NO": "C03",
        "NAME": "印尼泗水臺灣學校"
    },
    {
        "NO": "C04",
        "NAME": "胡志明市臺灣學校"
    },
    {
        "NO": "C05",
        "NAME": "泰國中華國際學校"
    },
    {
        "NO": "C06",
        "NAME": "檳吉臺灣學校"
    },
    {
        "NO": "C07",
        "NAME": "東莞台商子弟學校"
    },
    {
        "NO": "C08",
        "NAME": "華東臺商子女學校"
    },
    {
        "NO": "C09",
        "NAME": "上海台商子女學校"
    },
    {
        "NO": "D01",
        "NAME": "雲林縣台灣復興藝術實驗教育機構"
    }
];
var canadd = ["801", "802"];
var limit = false;
async function add_school() {   
    var opt = document.getElementById("school");
    for (var i = 0; i < school.length; i++) {
        if (limit && canadd.indexOf(school[i]["NO"]) === -1)
            continue;
        var add = document.createElement("option");
        add.setAttribute("value", school[i]["NO"]);
        add.innerText = school[i]["NO"] + " : " + school[i]["NAME"];
        opt.appendChild(add);
    }
    opt.value = "801";
}
add_school();